app/views/pins/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."pin_id" = $1  [["pin_id", 7]]
---
          <div class="panel-body">
          <% @pin.comments.each do |comment| %>