app/views/user_infos/index.html.erb

          <h3><%= @user.user_info.fname.titleize %> <%= @user.user_info.lname.titleize %></h3>
          <% if @user.pins.count == 0 %>
---
SELECT COUNT(*) FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 1]]