app/views/user_infos/show.html.erb

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 1]]
---
  <div class="transitions-enabled">
  <% @user.pins.each do |pin| %>