app/controllers/comments_controller.rb

  def create

    puts @comment
    @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("pin_id", "comment_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pin_id", 11], ["comment_text", "asdasd"], ["created_at", "2015-06-17 08:46:52.883274"], ["updated_at", "2015-06-17 08:46:52.883274"]]

  def destroy
    comment = Comment.find(params[:id])
    comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]