app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
---
  def index
    @pins = Pin.all.order("created_at DESC")

INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["user_id", 4], ["created_at", "2015-06-16 10:33:06.125115"], ["updated_at", "2015-06-16 10:33:06.125115"]]
---
  def create
  	@pin = current_user.pins.build(pin_params)

    if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "alawakbarssssss"], ["updated_at", "2015-06-05 07:53:47.354709"], ["id", 1]]
---
  def update
    if @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]
---
  def destroy
    @pin.destroy

SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
SELECT "users".* FROM "users"
---
  def fetch
    @allPins = Pin.all.order("created_at DESC")
    @allUsers = User.all

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 8]]
---
  def find_pin
    @pin = Pin.find(params[:id])