app/controllers/user_infos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  def index
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find(current_user)

INSERT INTO "user_infos" ("user_id", "fname", "lname", "bday", "address", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user_info = current_user.build_user_info(profile_params)

    if @user_info.save

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "user_infos" SET "bday" = $1, "updated_at" = $2 WHERE "user_infos"."id" = $3  [["bday", "1993-08-08"], ["updated_at", "2015-06-16 10:27:15.205236"], ["id", 14]]
---
  def update
    @user_info = UserInfo.find(params[:id])
      if @user_info.update(profile_params)