app/views/profile/profile.html.erb

          <h3><%= @user.user_info.fname %> <%= @user.user_info.lname %></h3>
          <h4><%= link_to @user.pins.count  %> Post</h4>
---
SELECT COUNT(*) FROM "pins" WHERE "pins"."user_id" = $1  [["user_id", 1]]